---
kind: other
id: Methods.T:Autodesk.Revit.DB.IntersectionResultArray
source: html/adcb8654-3c61-b148-5042-100684406945.htm
---
# IntersectionResultArray Methods

Removes every item from the array, rendering it empty.